In [21]:
import pandas as pd

In [22]:
orders = pd.read_table('http://bit.ly/chiporders')

In [23]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [24]:
user_cols = ['user_ID', 'age', 'sex', 'role', 'zip']


users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols) # sep tells that '|' is separating the data elements of the given table, to let it identify which all columns are present
                                                                # header = None , tells that there is no header in the given table

In [25]:
users.head()

   user_ID  age sex        role    zip
0        1   24   M  technician  85711
1        2   53   F       other  94043
2        3   23   M      writer  32067
3        4   24   M  technician  43537
4        5   33   F       other  15213

In [26]:
# DATAFRAME
# dataframe is a collection of data in rows and columns and each of these columns is known as Pandas series.

ufo = pd.read_csv('http://bit.ly/uforeports')   # csv files are those, in which the data is separated by a ','
# ufo = pd.read_table('http://bit.ly/uforeports', sep=',')   # we could also use this statement instead of the above statement

In [27]:
type(ufo)

pandas.core.frame.DataFrame

In [28]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [33]:
ufo['City']               # it is a series, as mentioned in the definition of dataframe
ufo.City                  # this is same as the above command
                          # we can't use the above command, if our column header is a built in attribute, bcoz then it conflicts and an error might appear

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [34]:
ufo['Colors Reported']    # we can't write it as ufo.Colors Reported, bcoz there is a gap between colors and reported

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [35]:
type(ufo['City'])   # cross checking the type

pandas.core.series.Series

In [36]:
# Combining 2 series in dataframe
ufo.City + ',' + ufo.State

0                      Ithaca,NY
1                 Willingboro,NJ
2                     Holyoke,CO
3                     Abilene,KS
4        New York Worlds Fair,NY
                  ...
18236              Grant Park,IL
18237             Spirit Lake,IA
18238             Eagle River,WI
18239             Eagle River,WI
18240                    Ybor,FL
Length: 18241, dtype: object

In [37]:
# Making a new series of the above combined series
ufo['Location'] = ufo.City + ',' + ufo.State

In [38]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"